app/controllers/pokemons_controller.rb

SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]
---
    def set_pokemon
      @pokemon = Pokemon.find(params[:id])