app/controllers/pokemons_controller.rb

SELECT "pokemons".* FROM "pokemons"
---
  def index

  #  @pokemons = request_api['results']
    @pokemon = Pokemon.all

INSERT INTO "pokemons" ("order", "name", "base_experience", "value_satoshi", "value_dolar", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @pokemon = Pokemon.new(pokemon_params)

    respond_to do |format|
      if @pokemon.save

DELETE FROM "pokemons" WHERE "pokemons"."id" = ?  [["id", 3]]
---
  def destroy
    @pokemon.destroy

SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_pokemon
      @pokemon = Pokemon.find(params[:id])