app/controllers/wallets_controller.rb

SELECT "wallets".* FROM "wallets" WHERE "wallets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_wallet
      @wallet = Wallet.find(params[:id])