app/controllers/wallets_controller.rb

SELECT "wallets".* FROM "wallets"
---
  def index
    @wallets = Wallet.all

INSERT INTO "wallets" ("user", "satoshi", "dollar", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user", "Felipe"], ["satoshi", 0.0], ["dollar", 0.0], ["created_at", "2022-04-19 23:56:57.234952"], ["updated_at", "2022-04-19 23:56:57.234952"]]
---
  def create
    @wallet = Wallet.new(wallet_params)

    respond_to do |format|
      if @wallet.save

SELECT "pokemons".* FROM "pokemons"
---
  def get_satoshi
    get_satoshi = []
    i = 0
    @pokemons = Pokemon.all

    @pokemons.each do |satoshi|

SELECT "wallets".* FROM "wallets" WHERE "wallets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_wallet
      @wallet = Wallet.find(params[:id])